import { Component } from '@angular/core';

@Component({
  selector: 'app-schedule',
  imports: [],
  templateUrl: './schedule.component.html',
  styleUrl: './schedule.component.scss'
})
export class ScheduleComponent {
  weekSchedule = [
    { label: 'ВТ, 5 КВІТНЯ', times: ['9:00', '9:30', '10:00', '10:30', '11:00', '11:30', '12:00', '12:30', '13:00'] },
    { label: 'СР, 6 КВІТНЯ', times: ['9:00', '9:30', '10:00', '10:30', '11:00', '11:30', '12:00', '12:30', '13:00'] },
    { label: 'ЧТ, 7 КВІТНЯ', times: ['9:00', '9:30', '10:00', '10:30', '11:00', '11:30', '12:00', '12:30', '13:00'] },
    { label: 'ПТ, 8 КВІТНЯ', times: ['9:00', '9:30', '10:00', '10:30', '11:00', '11:30', '12:00', '12:30', '13:00'] },
    { label: 'ПН, 11 КВІТНЯ', times: ['9:00', '9:30', '10:00', '10:30', '11:00', '11:30', '12:00', '12:30', '13:00'] },
    { label: 'ВТ, 12 КВІТНЯ', times: ['9:00', '9:30', '10:00', '10:30', '11:00', '11:30', '12:00', '12:30', '13:00'] },
  ];
}